energia/msp430-lg-core/libraries/Wire/utility/twi.c
#if DEFAULT_I2C == -1 // SW I2C implementation on default port
uint16_t I2C_baseAddress = -1;
#endif
#if DEFAULT_I2C == 0
uint16_t I2C_baseAddress = UCB0_BASE;
#endif
#if DEFAULT_I2C == 1
uint16_t I2C_baseAddress = UCB1_BASE;
#endif
#if DEFAULT_I2C == 2
uint16_t I2C_baseAddress = UCB2_BASE;
#endif


/*
 * Function twi_setModule
 * Desc     Selects the I2C module to use
 * Input    Module instance
 * Output   none
 */
void twi_setModule(uint8_t _i2cModule)
{
#if DEFAULT_I2C == -1 // SW I2C implementation on default port
	if (_i2cModule == -1)
	{
		I2C_baseAddress = -1;
	}
#endif
	if (_i2cModule == 0)
	{
#if defined(__MSP430_HAS_USCI__) || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_EUSCI_B0__)
		I2C_baseAddress = UCB0_BASE;
#endif
	}
	if (_i2cModule == 1)
	{
#if defined(__MSP430_HAS_USCI_B1__) || defined(__MSP430_HAS_EUSCI_B1__)
		I2C_baseAddress = UCB1_BASE;
#endif
#if defined(__MSP430_HAS_USCI_B2__) || defined(__MSP430_HAS_EUSCI_B2__)
		I2C_baseAddress = UCB2_BASE;
#endif
	}
}

/*
 * Function twi_init_port
 * Desc     initialises the port pins
 * Input    none
 * Output   none
 */
static void twi_init_port(void)
{
#if DEFAULT_I2C == -1 // SW I2C implementation on default port
	if (I2C_baseAddress == -1)
	{
		//pinMode_int(TWISDA1, TWISDA1_SET_MODE);
		//pinMode_int(TWISCL1, TWISCL1_SET_MODE);
		i2c_sw_init();
		return;
	}
#endif
#if defined(__MSP430_HAS_USCI__)
	if (I2C_baseAddress == UCB0_BASE)
	{
		pinMode_int(TWISDA0, TWISDA0_SET_MODE);
		pinMode_int(TWISCL0, TWISCL0_SET_MODE);
		return;
	}
#endif
#if defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_EUSCI_B0__)
	if (I2C_baseAddress == UCB0_BASE)
	{
		/* Set pins to I2C mode */
		pinMode_int(TWISDA0, INPUT_PULLUP);
		if (digitalRead(TWISDA0) == 0){ // toggle SCL if SDA is low at startup
			pinMode_int(TWISCL0, INPUT_PULLUP);
			digitalWrite(TWISCL0, LOW);
			pinMode(TWISCL0, OUTPUT);
			pinMode_int(TWISCL0, INPUT_PULLUP);
		}
#if defined(__MSP430_HAS_USCI_B0__)
		if ((TWISDA0_SET_MODE & INPUT_PULLUP) == 0) {
			pinMode(TWISDA0, INPUT);          // some device do not allow the pull up to be enabled
			pinMode(TWISCL0, INPUT);
		}
#endif
		pinMode_int(TWISDA0, TWISDA0_SET_MODE);
		pinMode_int(TWISCL0, TWISCL0_SET_MODE);
	}
#endif
#if defined(__MSP430_HAS_USCI_B1__) || defined(__MSP430_HAS_EUSCI_B1__)
	if (I2C_baseAddress == UCB1_BASE)
	{
		/* Set pins to I2C mode */
		pinMode_int(TWISDA1, INPUT_PULLUP);
		if (digitalRead(TWISDA1) == 0){ // toggle SCL if SDA is low at startup
			pinMode_int(TWISCL1, INPUT_PULLUP);
			digitalWrite(TWISCL1, LOW);
			pinMode(TWISCL1, OUTPUT);
			pinMode_int(TWISCL1, INPUT_PULLUP);
		}
#if defined(__MSP430_HAS_USCI_B1__)
		if ((TWISDA1_SET_MODE & INPUT_PULLUP) == 0) {
			pinMode(TWISDA1, INPUT);          // some device do not allow the pull up to be enabled
			pinMode(TWISCL1, INPUT);
		}
#endif
		pinMode_int(TWISDA1, TWISDA1_SET_MODE);
		pinMode_int(TWISCL1, TWISCL1_SET_MODE);
	}
#endif
#if defined(__MSP430_HAS_USCI_B2__) || defined(__MSP430_HAS_EUSCI_B2__)
	if (I2C_baseAddress == UCB2_BASE)
	{
		/* Set pins to I2C mode */
		pinMode_int(TWISDA2, INPUT_PULLUP);
		if (digitalRead(TWISDA2) == 0){ // toggle SCL if SDA is low at startup
			pinMode_int(TWISCL2, INPUT_PULLUP);
			digitalWrite(TWISCL2, LOW);
			pinMode(TWISCL2, OUTPUT);
			pinMode_int(TWISCL2, INPUT_PULLUP);
		}
#if defined(__MSP430_HAS_USCI_B2__)
		if ((TWISDA2_SET_MODE & INPUT_PULLUP) == 0) {
			pinMode(TWISDA2, INPUT);          // some device do not allow the pull up to be enabled
			pinMode(TWISCL2, INPUT);
		}
#endif
		pinMode_int(TWISDA2, TWISDA2_SET_MODE);
		pinMode_int(TWISCL2, TWISCL2_SET_MODE);
	}
#endif
}

/*
 * Function twi_init
 * Desc     readys twi pins and sets twi bitrate
 * Input    none
 * Output   none
 */
void twi_init(void)
{
	// initialize state
	twi_state = TWI_IDLE;
	twi_sendStop = true;		// default value
	twi_inRepStart = false;

#if DEFAULT_I2C == -1 // SW I2C implementation on default port
	if (I2C_baseAddress == -1)
	{
		twi_init_port();
		return;
	}
#endif

#if defined(__MSP430_HAS_USI__)

	/* 100 KHz for all */
#if (F_CPU >= 16000000L) || (F_CPU >= 12000000L)
	USICKCTL = USIDIV_7;
#elif defined(CALBC1_8MHZ_) && (F_CPU >= 8000000L)
	USICKCTL = USIDIV_6;
#elif defined(CALBC1_1MHZ_) && (F_CPU >= 1000000L)
	USICKCTL = USIDIV_3;
#endif
	/* Enable USI I2C mode. */
	USICTL1 = USII2C;
	/* SDA/SCL port enable and hold in reset */
	USICTL0 = (USIPE6 | USIPE7 | USISWRST);
	/* SMCLK and SCL inactive state is high */
	USICKCTL |= (USISSEL_2 | USICKPL);
	/* Disable automatic clear control */
	USICNT |= USIIFGCC;
	/* Enable USI */
	USICTL0 &= ~USISWRST;
	/* Counter interrupt enable */
	USICTL1 |= USIIE;
#endif

#if defined(__MSP430_HAS_USCI__) \
 || defined(__MSP430_HAS_USCI_B0__) || defined(__MSP430_HAS_USCI_B1__)

    /* Calling this dummy function prevents the linker
     * from stripping the USCI interupt vectors.*/ 
    usci_isr_install();
	
	twi_init_port();

    //Disable the USCI module and clears the other bits of control register
    UCBzCTL1 = UCSWRST;

     /*
     * Configure as I2C Slave.
     * UCMODE_3 = I2C mode
     * UCSYNC = Synchronous mode
     * UCCLK = SMCLK
     */
    UCBzCTL0 = UCMODE_3 | UCSYNC;
    /*
     * Compute the clock divider that achieves less than or
     * equal to 100kHz.  The numerator is biased to favor a larger
     * clock divider so that the resulting clock is always less than or equal
     * to the desired clock, never greater.
     */
    UCBzBR0 = (unsigned char)((F_CPU / TWI_FREQ) & 0xFF);
    UCBzBR1 = (unsigned char)((F_CPU / TWI_FREQ) >> 8);

    UCBzCTL1 &= ~(UCSWRST);

#if defined(__MSP430_HAS_USCI__)
    /* Set I2C state change interrupt mask */
    UCBzI2CIE |= (UCALIE|UCNACKIE|UCSTTIE|UCSTPIE);
    /* Enable state change and TX/RX interrupts */
    UCxIE |= UCBzRXIE | UCBzTXIE;
#else
    /* Set I2C state change interrupt mask and TX/RX interrupts */
    UCBzIE |= (UCALIE|UCNACKIE|UCSTTIE|UCSTPIE|UCRXIE|UCTXIE);
#endif
#endif
#if defined(__MSP430_HAS_EUSCI_B0__) || defined(__MSP430_HAS_EUSCI_B1__) || defined(__MSP430_HAS_EUSCI_B2__)
	twi_init_port();
	
    //Disable the USCI module and clears the other bits of control register
    UCBzCTLW0 = UCSWRST;

