energia/msp430-lg-core/libraries/Wire/utility/twi.c
uint16_t i2c_state_isr(void)  // I2C Service
{
	uint16_t stay_active = false;

	/* Arbitration lost interrupt flag */
#if defined(__MSP430_HAS_USCI__)
	if (UCBzSTAT & UCALIFG) {
		UCBzSTAT &= ~UCALIFG;
#else
	if (UCBzIFG & UCALIFG) {
		UCBzIFG &= ~UCALIFG;
#endif
		/* TODO: Handle bus arbitration lost */
	}
	/* Not-acknowledge received interrupt flag. 
	 * UCNACKIFG is automatically cleared when a START condition is received.*/
#if defined(__MSP430_HAS_USCI__)
	if (UCBzSTAT & UCNACKIFG) {
		UCBzSTAT &= ~UCNACKIFG;
#else
	if (UCBzIFG & UCNACKIFG) {
		UCBzIFG &= ~UCNACKIFG;
#endif
		////UCBzCTL1 |= UCTXSTP;
		/* TODO: This can just as well be an address NACK.
		 * Figure out a way to distinguish between ANACK and DNACK */
		if (twi_masterBufferIndex == 0)
			twi_error = TWI_ERROR_ADDR_NACK;
		else
			twi_error = TWI_ERROR_DATA_NACK;
		//twi_state = TWI_IDLE;
		//stay_active = true;
	}
	/* Start condition interrupt flag.
	 * UCSTTIFG is automatically cleared if a STOP condition is received. */
#if defined(__MSP430_HAS_USCI__)
	 if (UCBzSTAT & UCSTTIFG) {
		UCBzSTAT &= ~UCSTTIFG;
#else
	 if (UCBzIFG & UCSTTIFG) {
		UCBzIFG &= ~UCSTTIFG;
#endif
		/* UCTR is automagically set by the USCI module upon a START condition. */
		if (UCBzCTL1 &  UCTR) {
			/* Slave TX mode. */
			twi_state =  TWI_STX;
			/* Ready the tx buffer index for iteration. */
			twi_txBufferIndex = 0;
			/* Set tx buffer length to be zero, to verify if user changes it. */
			twi_txBufferLength = 0;
			/* Request for txBuffer to be filled and length to be set. */
			/* note: user must call twi_transmit(bytes, length) to do this */
			twi_onSlaveTransmit();
			/* If they didn't change buffer & length, initialize it 
			 * TODO: Is this right? Shouldn't we reply with a NACK if there is no data to send? */
			if (0 == twi_txBufferLength) {
				twi_txBufferLength = 1;
				twi_txBuffer[0] = 0x00;
			}
		} else {
			/* Slave receive mode. */
			twi_state =  TWI_SRX;
			/* Indicate that rx buffer can be overwritten and ACK */
			twi_rxBufferIndex = 0;
		}
	}
	/* Stop condition interrupt flag.
	 * UCSTPIFG is automatically cleared when a STOP condition is received. */
#if defined(__MSP430_HAS_USCI__)
	if (UCBzSTAT & UCSTPIFG) {
		UCBzSTAT &= ~UCSTPIFG;
#else
	if (UCBzIFG & UCSTPIFG) {
		UCBzIFG &= ~UCSTPIFG;
#endif
		if (twi_state ==  TWI_SRX) {
			/* Callback to user defined callback */
			twi_onSlaveReceive(twi_rxBuffer, twi_rxBufferIndex);
		}
		twi_state =  TWI_IDLE;
		stay_active = true;
	}
	return(stay_active);
}
#endif

#if defined(__MSP430_HAS_EUSCI_B0__) || defined(__MSP430_HAS_EUSCI_B1__) || defined(__MSP430_HAS_EUSCI_B2__)
uint16_t eusci_isr_handler(void)
{
  uint16_t exit_lpm = 0;
//	switch(twi_state){
  switch(UCBzIV){
    case USCI_NONE:            // No Interrupt pending
      break;
    case USCI_I2C_UCALIFG:     // USCI I2C Mode: UCALIFG
      // enter slave transmitter mode
      twi_state = TWI_STX;
      // ready the tx buffer index for iteration
      twi_txBufferIndex = 0;
      // set tx buffer length to be zero, to verify if user changes it
      twi_txBufferLength = 0;
      // request for txBuffer to be filled and length to be set
      // note: user must call twi_transmit(bytes, length) to do this
      twi_onSlaveTransmit();
      // if they didn't change buffer & length, initialize it
      if(0 == twi_txBufferLength){
        twi_txBufferLength = 1;
        twi_txBuffer[0] = 0x00;
      }
      // transmit first byte from buffer, fall
      // copy data to output register
      UCBzTXBUF = twi_txBuffer[twi_txBufferIndex++];
      // if there is more to send, ack, otherwise nack
      if(twi_txBufferIndex < twi_txBufferLength){
        //twi_reply(1);
      } else {
		UCBzCTLW0 |= UCTXNACK;                // Generate NACK condition
      }
      // leave slave receiver state
      twi_state = TWI_IDLE;

      break;
    case USCI_I2C_UCNACKIFG:   // USCI I2C Mode: UCNACKIFG
		if (twi_masterBufferIndex == 0) // when no data, we received the address
			twi_error = TWI_ERROR_ADDR_NACK;
	    else
			twi_error = TWI_ERROR_DATA_NACK;
        // leave slave receiver state
        twi_state = TWI_IDLE;
		if (UCBzTBCNT == 0) 
			UCBzCTLW0 |= UCTXSTP;                // Generate I2C stop condition manually
		exit_lpm = 1; //__bic_SR_register_on_exit(LPM4_bits); // Exit LPM
      break;
    case USCI_I2C_UCSTTIFG:    // USCI I2C Mode: UCSTTIFG
		UCBzIFG &= ~UCSTTIFG;
		if (twi_state ==  TWI_IDLE){
			if (UCBzCTLW0 &  UCTR){
				twi_state =  TWI_STX;      // Slave Transmit mode
				// ready the tx buffer index for iteration
				twi_txBufferIndex = 0;
				// set tx buffer length to be zero, to verify if user changes it
				twi_txBufferLength = 0;
				// request for txBuffer to be filled and length to be set
				// note: user must call twi_transmit(bytes, length) to do this
				twi_onSlaveTransmit();
				// if they didn't change buffer & length, initialize it
				if(0 == twi_txBufferLength){
					twi_txBufferLength = 1;
					twi_txBuffer[0] = 0x00;
				}
			} else {
				twi_state =  TWI_SRX;      // Slave receive mode
				// indicate that rx buffer can be overwritten and ack
				twi_rxBufferIndex = 0;
			}
		}
      break;
    case USCI_I2C_UCSTPIFG:    // USCI I2C Mode: UCSTPIFG
        //UCBzIFG &= ~UCSTPIFG;
		if (twi_state ==  TWI_SRX){
			// callback to user defined callback
			twi_onSlaveReceive(twi_rxBuffer, twi_rxBufferIndex);
		}
		twi_state =  TWI_IDLE; // IDLE mode
		/* Work around for:
		 * If the master does a read and then a write the START interrupt occurs
		 * but the RX interrupt never fires. Clearing bit 4 and 5 of UCBzCTLW0 solves this.
		 * bit 4 and 5 are however marked as reserved in the datasheet.
		 */
		UCBzCTLW0 &= ~0x18;

		exit_lpm = 1; //__bic_SR_register_on_exit(LPM4_bits); // Exit LPM
      break;
    case USCI_I2C_UCRXIFG3:    // USCI I2C Mode: UCRXIFG3
      break;
    case USCI_I2C_UCTXIFG3:    // USCI I2C Mode: UCTXIFG3
      break;
    case USCI_I2C_UCRXIFG2:    // USCI I2C Mode: UCRXIFG2
      break;
    case USCI_I2C_UCTXIFG2:    // USCI I2C Mode: UCTXIFG2
      break;
    case USCI_I2C_UCRXIFG1:    // USCI I2C Mode: UCRXIFG1
      break;
    case USCI_I2C_UCTXIFG1:    // USCI I2C Mode: UCTXIFG1
      break;
    case USCI_I2C_UCRXIFG0:    // USCI I2C Mode: UCRXIFG0
		//UCBzIFG &= ~UCRXIFG;                  // Clear USCI_B0 TX int flag
		if (twi_state ==  TWI_MRX) {      // Master receive mode
			twi_masterBuffer[twi_masterBufferIndex++] = UCBzRXBUF; // Get RX data
			if(twi_masterBufferIndex == twi_masterBufferLength )
				UCBzCTLW0 |= UCTXSTP;  // Generate I2C stop condition
			if(twi_masterBufferIndex > twi_masterBufferLength ) {
				twi_state = TWI_IDLE; //Idle
			} else {
			}
		} else {
			// if there is still room in the rx buffer
			if(twi_rxBufferIndex < TWI_BUFFER_LENGTH){
				// put byte in buffer and ack
				twi_rxBuffer[twi_rxBufferIndex++] = UCBzRXBUF;
			} else {
				// otherwise nack
				UCBzCTLW0 |= UCTXNACK;                // Generate NACK condition
			}
		}
      break;
    case USCI_I2C_UCTXIFG0:    // USCI I2C Mode: UCTXIFG0
		//UCBzIFG &= ~UCTXIFG;                  // Clear USCI_B0 TX int flag
		if (twi_state == TWI_MTX) {      // Master transmit mode
			// if there is data to send, send it, otherwise stop
			if(twi_masterBufferIndex < twi_masterBufferLength){
				// copy data to output register and ack
				UCBzTXBUF = twi_masterBuffer[twi_masterBufferIndex++];                 // Transmit data at address PTxData
			}else{
			   if (twi_sendStop) {
				 if (UCBzTBCNT == 0) 
					 UCBzCTLW0 |= UCTXSTP;                // Generate I2C stop condition manually
			   } else {
				 twi_inRepStart = true;   // we're gonna send the START
				 // don't enable the interrupt. We'll generate the start, but we
				 // avoid handling the interrupt until we're in the next transaction,
				 // at the point where we would normally issue the start.
				 UCBzCTLW0 |= UCTXSTT;
				 twi_state = TWI_IDLE;
				 exit_lpm = 1; //__bic_SR_register_on_exit(LPM4_bits); // Exit LPM
			   }
			}
		} else if (twi_state == TWI_MRX) {      // Master receive mode
			// copy data to output register
			UCBzTXBUF = twi_txBuffer[twi_txBufferIndex++];
			// if there is more to send, ack, otherwise nack
			if(twi_txBufferIndex < twi_txBufferLength){
			} else {
				UCBzCTLW0 |= UCTXNACK;                // Generate NACK condition
			}
		}
      break;
    case USCI_I2C_UCBCNTIFG:   // USCI I2C Mode: UCBCNTIFG
      break;
    case USCI_I2C_UCCLTOIFG:   // USCI I2C Mode: UCCLTOIFG/
      break;
    case USCI_I2C_UCBIT9IFG:   // USCI I2C Mode: UCBIT9IFG
      break;
	}
	return (exit_lpm);
}

#if defined(__MSP430_HAS_EUSCI_B0__)
__attribute__((interrupt(USCI_B0_VECTOR)))
void USCI_B0_ISR(void)
{
	if (eusci_isr_handler()) 
		__bic_SR_register_on_exit(LPM4_bits); // Exit LPM
} 
#endif

#if defined(__MSP430_HAS_EUSCI_B1__)
__attribute__((interrupt(USCI_B1_VECTOR)))
void USCI_B1_ISR(void)
{
	if (eusci_isr_handler()) 
		__bic_SR_register_on_exit(LPM4_bits); // Exit LPM
}	
#endif

#if defined(__MSP430_HAS_EUSCI_B2__)
__attribute__((interrupt(USCI_B2_VECTOR)))
void USCI_B2_ISR(void)
{
	if (eusci_isr_handler()) 
		__bic_SR_register_on_exit(LPM4_bits); // Exit LPM
}	
#endif

#endif // #if defined(__MSP430_HAS_EUSCI_B0__) || defined(__MSP430_HAS_EUSCI_B1__) || defined(__MSP430_HAS_EUSCI_B2__)

